leander98/esp32-flight-controller/main/main.c
/** @brief Return one XW30A channel's active settings to the web API. */
static esp_err_t get_remote_esc_config(
    esp32_wifi_drone_remote_esc_config_t *config,
    void *context)
{
    (void)context;
    if (config == NULL || config->index >= ESC_COUNT ||
        s_esc_mutex == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (xSemaphoreTake(s_esc_mutex, pdMS_TO_TICKS(250)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }
    const xw30a_config_t *active = &s_esc_configs[config->index];
    config->signal_gpio = active->signal_gpio;
    config->pwm_frequency_hz = active->pwm_frequency_hz;
    config->min_pulse_us = active->min_pulse_us;
    config->max_pulse_us = active->max_pulse_us;
    config->calibration_high_time_ms = active->calibration_high_time_ms;
    xSemaphoreGive(s_esc_mutex);
    return ESP_OK;
}

/** @brief Recreate and persist one XW30A channel with submitted settings. */
static esp_err_t set_remote_esc_config(
    const esp32_wifi_drone_remote_esc_config_t *config,
    void *context)
{
    (void)context;
    if (config == NULL || config->index >= ESC_COUNT ||
        s_esc_mutex == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    xw30a_config_t replacement = {
        .signal_gpio = config->signal_gpio,
        .mcpwm_group_id = config->index < 2U ? 0 : 1,
        .pwm_frequency_hz = config->pwm_frequency_hz,
        .min_pulse_us = config->min_pulse_us,
        .max_pulse_us = config->max_pulse_us,
        .calibration_high_time_ms = config->calibration_high_time_ms,
    };
    if (!is_valid_esc_config(&replacement) ||
        xSemaphoreTake(s_esc_mutex, pdMS_TO_TICKS(1000)) != pdTRUE) {
        return ESP_ERR_INVALID_ARG;
    }
    for (size_t index = 0; index < ESC_COUNT; ++index) {
        if (index != config->index &&
            s_esc_configs[index].signal_gpio == replacement.signal_gpio) {
            xSemaphoreGive(s_esc_mutex);
            return ESP_ERR_INVALID_ARG;
        }
    }

    const uint8_t index = config->index;
    const xw30a_config_t previous = s_esc_configs[index];
    xw30a_del(s_esc_handles[index]);
    s_esc_handles[index] = NULL;
    esp_err_t err = xw30a_new(&replacement, &s_esc_handles[index]);
    if (err == ESP_OK) {
        s_esc_configs[index] = replacement;
        err = save_esc_configs();
    }
    if (err != ESP_OK) {
        if (s_esc_handles[index] != NULL) {
            xw30a_del(s_esc_handles[index]);
            s_esc_handles[index] = NULL;
        }
        s_esc_configs[index] = previous;
        esp_err_t restore_err =
            xw30a_new(&previous, &s_esc_handles[index]);
        if (restore_err != ESP_OK) {
            ESP_LOGE(APP_TAG, "Failed to restore ESC %u: %s",
                     (unsigned)(index + 1U),
                     esp_err_to_name(restore_err));
        }
    }
    xSemaphoreGive(s_esc_mutex);
    return err;
}

/** @brief Apply a manual browser throttle command to one XW30A channel. */
static esp_err_t set_remote_esc_throttle(
    uint8_t index,
    float throttle,
    void *context)
{
    (void)context;
    if (index >= ESC_COUNT || throttle < 0.0f || throttle > 1.0f ||
        s_esc_mutex == NULL || s_flight_mutex == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (xSemaphoreTake(s_flight_mutex, pdMS_TO_TICKS(50)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }
    bool flight_armed = s_flight_controller.armed;
    xSemaphoreGive(s_flight_mutex);
    if (flight_armed) {
        return ESP_ERR_INVALID_STATE;
    }
    if (xSemaphoreTake(s_esc_mutex, pdMS_TO_TICKS(250)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }
    esp_err_t err = s_esc_handles[index] == NULL
        ? ESP_ERR_INVALID_STATE
        : xw30a_control_set_throttle(s_esc_handles[index], throttle);
    xSemaphoreGive(s_esc_mutex);
    return err;
}

/** @brief Dispatch one guided audible-programming operation to an ESC. */
static esp_err_t program_remote_esc(
    uint8_t index,
    esp32_wifi_drone_remote_esc_program_action_t action,
    uint8_t selection,
    void *context)
{
    (void)context;
    if (index >= ESC_COUNT || s_esc_mutex == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (action == ESP32_WIFI_ESC_PROGRAM_BEGIN) {
        if (s_flight_mutex == NULL ||
            xSemaphoreTake(s_flight_mutex, pdMS_TO_TICKS(50)) != pdTRUE) {
            return ESP_ERR_TIMEOUT;
        }
        bool flight_armed = s_flight_controller.armed;
        xSemaphoreGive(s_flight_mutex);
        if (flight_armed) {
            return ESP_ERR_INVALID_STATE;
        }
    }
    if (xSemaphoreTake(s_esc_mutex, pdMS_TO_TICKS(500)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }
    xw30a_handle_t handle = s_esc_handles[index];
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (handle != NULL) {
        if (action == ESP32_WIFI_ESC_PROGRAM_BEGIN &&
            s_programming_esc_index >= 0) {
            xSemaphoreGive(s_esc_mutex);
            return ESP_ERR_INVALID_STATE;
        }
        if (action != ESP32_WIFI_ESC_PROGRAM_BEGIN &&
            s_programming_esc_index != index) {
            xSemaphoreGive(s_esc_mutex);
            return ESP_ERR_INVALID_STATE;
        }
        switch (action) {
        case ESP32_WIFI_ESC_PROGRAM_BEGIN:
            for (size_t channel = 0; channel < ESC_COUNT; ++channel) {
                err = xw30a_control_stop(s_esc_handles[channel]);
                if (err != ESP_OK) {
                    break;
                }
            }
            if (err != ESP_OK) {
                break;
            }
            err = xw30a_setup_begin_programming(handle);
            if (err == ESP_OK) {
                s_programming_esc_index = index;
            }
            break;
        case ESP32_WIFI_ESC_PROGRAM_SELECT_ITEM:
            err = xw30a_setup_select_program_item(
                handle, (xw30a_program_item_t)selection);
            if (err == ESP_OK &&
                selection == XW30A_PROGRAM_ITEM_EXIT) {
                s_programming_esc_index = -1;
            }
            break;
        case ESP32_WIFI_ESC_PROGRAM_STORE_VALUE:
            err = xw30a_setup_store_program_value(
                handle, (xw30a_program_value_t)selection);
            break;
        case ESP32_WIFI_ESC_PROGRAM_CONTINUE:
            err = xw30a_setup_finish_programming_value(handle, true);
            break;
        case ESP32_WIFI_ESC_PROGRAM_EXIT:
            err = xw30a_setup_finish_programming_value(handle, false);
            if (err == ESP_OK) {
                s_programming_esc_index = -1;
            }
            break;
        case ESP32_WIFI_ESC_PROGRAM_CANCEL:
            err = xw30a_setup_cancel(handle);
            if (err == ESP_OK) {
                s_programming_esc_index = -1;
            }
            break;
        default:
            err = ESP_ERR_INVALID_ARG;
            break;
        }
    }
    xSemaphoreGive(s_esc_mutex);
    return err;
}

/** @brief Clamp a normalized controller value to its supported interval. */
static float clamp_normalized(float value)
{
    if (value < -1.0f) {
        return -1.0f;
    }
    if (value > 1.0f) {
        return 1.0f;
    }
    return value;
}

/**
 * @brief Convert browser stick and arming requests into flight setpoints.
 *
 * The left stick controls yaw and collective throttle. Its center position is
 * the configured open-loop hover estimate (50 percent). The right stick
 * controls desired roll and pitch angles.
 */
static esp_err_t handle_flight_request(
    const char *uri,
    const uint8_t *body,
    size_t body_length,
    void *context)
{
    (void)context;
    if (uri == NULL || body == NULL || body_length >= 96U ||
        s_flight_mutex == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    char json[96];
    memcpy(json, body, body_length);
    json[body_length] = '\0';
    if (xSemaphoreTake(s_flight_mutex, pdMS_TO_TICKS(50)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }

    const uint64_t now_us = (uint64_t)esp_timer_get_time();
    esp_err_t err = ESP_OK;
    if (strcmp(uri, "/api/left-stick") == 0) {
        float x;
        float y;
        if (sscanf(json, "{\"x\":%f,\"y\":%f}", &x, &y) != 2) {
            err = ESP_ERR_INVALID_ARG;
        } else {
            s_movement_command.yaw = clamp_normalized(x);
            s_movement_command.throttle =
                (clamp_normalized(y) + 1.0f) * 0.5f;
            err = flight_controller_set_movement(
                &s_flight_controller, &s_movement_command, now_us);
        }
    } else if (strcmp(uri, "/api/right-stick") == 0) {
        float x;
        float y;
        if (sscanf(json, "{\"x\":%f,\"y\":%f}", &x, &y) != 2) {
            err = ESP_ERR_INVALID_ARG;
        } else {
            s_movement_command.roll = clamp_normalized(x);
            s_movement_command.pitch = clamp_normalized(y);
            err = flight_controller_set_movement(
                &s_flight_controller, &s_movement_command, now_us);
        }
    } else if (strcmp(uri, "/api/settings") == 0) {
        if (strstr(json, "\"heartbeat\":true") != NULL) {
            err = flight_controller_heartbeat(&s_flight_controller, now_us);
        } else if (strstr(json, "\"armed\":true") != NULL) {
            err = s_programming_esc_index < 0 &&
                    s_movement_command.throttle <= 0.05f
                ? flight_controller_set_armed(
                    &s_flight_controller, true, now_us)
                : ESP_ERR_INVALID_STATE;
        } else if (strstr(json, "\"armed\":false") != NULL) {
            err = flight_controller_set_armed(
                &s_flight_controller, false, now_us);
            memset(&s_movement_command, 0, sizeof(s_movement_command));
        }
    }
    xSemaphoreGive(s_flight_mutex);
    return err;
}

/** @brief Return whether a persisted ISM330 configuration is supported. */
static bool is_valid_persistent_imu_config(
    const imu_persistent_config_t *config)
{
    return config != NULL &&
           config->version == IMU_CONFIG_VERSION &&
           config->accelerometer_odr <= ISM330DLC_ODR_6660_HZ &&
           config->gyroscope_odr <= ISM330DLC_ODR_6660_HZ &&
           config->accelerometer_full_scale <= ISM330DLC_ACCEL_FS_8G &&
           config->gyroscope_full_scale <= ISM330DLC_GYRO_FS_2000_DPS;
}

