leander98/esp32-flight-controller/main/main.c
/** @brief Restore valid PID gains from NVS into a default configuration. */
static esp_err_t load_pid_config(flight_controller_config_t *config)
{
    nvs_handle_t nvs;
    esp_err_t err = nvs_open(PID_NVS_NAMESPACE, NVS_READONLY, &nvs);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return ESP_OK;
    }
    if (err != ESP_OK) {
        return err;
    }
    pid_persistent_config_t stored = {0};
    size_t size = sizeof(stored);
    err = nvs_get_blob(nvs, PID_NVS_CONFIG_KEY, &stored, &size);
    nvs_close(nvs);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return ESP_OK;
    }
    if (err != ESP_OK) {
        return err;
    }
    if (size != sizeof(stored) || stored.version != PID_CONFIG_VERSION ||
        !is_valid_pid_config(&stored.gains)) {
        ESP_LOGW(APP_TAG, "Ignoring invalid persisted PID gains");
        return ESP_OK;
    }
    apply_pid_config(config, &stored.gains);
    ESP_LOGI(APP_TAG, "Restored persisted flight-controller PID gains");
    return ESP_OK;
}

/** @brief Return active flight-controller gains to the settings API. */
static esp_err_t get_remote_pid_config(
    esp32_wifi_drone_remote_pid_config_t *config,
    void *context)
{
    (void)context;
    if (config == NULL || s_flight_mutex == NULL ||
        xSemaphoreTake(s_flight_mutex, pdMS_TO_TICKS(250)) != pdTRUE) {
        return ESP_ERR_INVALID_ARG;
    }
    *config = export_pid_config(&s_flight_controller.config);
    xSemaphoreGive(s_flight_mutex);
    return ESP_OK;
}

/** @brief Apply and persist web-submitted PID gains while disarmed. */
static esp_err_t set_remote_pid_config(
    const esp32_wifi_drone_remote_pid_config_t *config,
    void *context)
{
    (void)context;
    if (!is_valid_pid_config(config) || s_flight_mutex == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (xSemaphoreTake(s_flight_mutex, pdMS_TO_TICKS(500)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }
    if (s_flight_controller.armed) {
        xSemaphoreGive(s_flight_mutex);
        return ESP_ERR_INVALID_STATE;
    }

    const flight_controller_config_t previous = s_flight_controller.config;
    apply_pid_config(&s_flight_controller.config, config);
    const pid_persistent_config_t stored = {
        .version = PID_CONFIG_VERSION,
        .gains = *config,
    };
    nvs_handle_t nvs = 0;
    esp_err_t err = nvs_open(PID_NVS_NAMESPACE, NVS_READWRITE, &nvs);
    if (err == ESP_OK) {
        err = nvs_set_blob(nvs, PID_NVS_CONFIG_KEY,
                           &stored, sizeof(stored));
    }
    if (err == ESP_OK) {
        err = nvs_commit(nvs);
    }
    if (err == ESP_OK) {
        s_flight_controller.roll_integral = 0.0f;
        s_flight_controller.pitch_integral = 0.0f;
        s_flight_controller.yaw_integral = 0.0f;
        s_flight_controller.previous_roll_error = 0.0f;
        s_flight_controller.previous_pitch_error = 0.0f;
        s_flight_controller.previous_yaw_error = 0.0f;
    } else {
        s_flight_controller.config = previous;
    }
    if (nvs != 0) {
        nvs_close(nvs);
    }
    xSemaphoreGive(s_flight_mutex);
    return err;
}

static esp_err_t initialize_imu(esp32_ism330dlc_t *imu)
{
    i2c_master_bus_handle_t bus;
    i2c_master_dev_handle_t device;

    const i2c_master_bus_config_t bus_config = {
        .i2c_port = IMU_I2C_PORT,
        .sda_io_num = IMU_I2C_SDA_GPIO,
        .scl_io_num = IMU_I2C_SCL_GPIO,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    esp_err_t err = i2c_new_master_bus(&bus_config, &bus);
    if (err != ESP_OK) {
        ESP_LOGE(APP_TAG, "Failed to initialize I2C bus: %s",
                 esp_err_to_name(err));
        return err;
    }

    const i2c_device_config_t device_config = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = IMU_I2C_ADDRESS,
        .scl_speed_hz = IMU_I2C_FREQUENCY,
    };
    err = i2c_master_bus_add_device(bus, &device_config, &device);
    if (err != ESP_OK) {
        ESP_LOGE(APP_TAG, "Failed to add ISM330DLC to I2C bus: %s",
                 esp_err_to_name(err));
        return err;
    }

    *imu = (esp32_ism330dlc_t)ESP32_ISM330DLC_DEFAULT_CONFIG(
        esp32_ism330dlc_i2c_read, esp32_ism330dlc_i2c_write, device);

    err = load_imu_config(imu);
    if (err != ESP_OK) {
        ESP_LOGW(APP_TAG, "Failed to load persisted ISM330 configuration: %s",
                 esp_err_to_name(err));
    }
    return esp32_ism330dlc_init(imu);
}

void app_main(void)
{
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES ||
        err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    if (err != ESP_OK) {
        ESP_LOGE(APP_TAG, "NVS initialization failed: %s",
                 esp_err_to_name(err));
        return;
    }

    s_imu_mutex = xSemaphoreCreateMutex();
    s_esc_mutex = xSemaphoreCreateMutex();
    s_flight_mutex = xSemaphoreCreateMutex();
    if (s_imu_mutex == NULL || s_esc_mutex == NULL ||
        s_flight_mutex == NULL) {
        ESP_LOGE(APP_TAG, "Failed to create sensor/control mutexes");
        return;
    }
    flight_controller_config_t flight_config =
        FLIGHT_CONTROLLER_DEFAULT_CONFIG();
    err = load_pid_config(&flight_config);
    if (err != ESP_OK) {
        ESP_LOGW(APP_TAG, "Failed to load persisted PID gains: %s",
                 esp_err_to_name(err));
    }
    err = flight_controller_init(&s_flight_controller, &flight_config);
    if (err != ESP_OK) {
        ESP_LOGE(APP_TAG, "Flight controller initialization failed: %s",
                 esp_err_to_name(err));
        return;
    }
    err = initialize_imu(&s_imu);
    if (err != ESP_OK) {
        ESP_LOGE(APP_TAG, "ISM330DLC initialization failed: %s",
                 esp_err_to_name(err));
        return;
    }
    err = initialize_escs();
    if (err != ESP_OK) {
        ESP_LOGE(APP_TAG, "XW30A initialization failed: %s",
                 esp_err_to_name(err));
        return;
    }

    esp32_wifi_drone_remote_config_t remote_config =
        ESP32_WIFI_DRONE_REMOTE_DEFAULT_CONFIG();
    remote_config.telemetry_handler = provide_remote_telemetry;
    remote_config.imu_get_handler = get_remote_imu_config;
    remote_config.imu_set_handler = set_remote_imu_config;
    remote_config.imu_context = &s_imu;
    remote_config.pid_get_handler = get_remote_pid_config;
    remote_config.pid_set_handler = set_remote_pid_config;
    remote_config.esc_get_handler = get_remote_esc_config;
    remote_config.esc_set_handler = set_remote_esc_config;
    remote_config.esc_throttle_handler = set_remote_esc_throttle;
    remote_config.esc_program_handler = program_remote_esc;
    remote_config.api_handler = handle_flight_request;
    err = esp32_wifi_drone_remote_start(&remote_config);
    if (err != ESP_OK) {
        ESP_LOGE(APP_TAG, "Wi-Fi drone remote initialization failed: %s",
                 esp_err_to_name(err));
        return;
    }

