leander98/esp32-flight-controller/main/main.c
    uint32_t sample_count = 0;
    int64_t previous_sample_us = esp_timer_get_time();
    bool flight_was_armed = false;

    while (true) {
        esp32_ism330dlc_sample_t sample;

        if (xSemaphoreTake(s_imu_mutex, pdMS_TO_TICKS(100)) != pdTRUE) {
            continue;
        }
        err = esp32_ism330dlc_read(&s_imu, &sample);
        xSemaphoreGive(s_imu_mutex);
        if (err == ESP_OK) {
            const int64_t now_us = esp_timer_get_time();
            float dt_seconds =
                (float)(now_us - previous_sample_us) / 1000000.0f;
            previous_sample_us = now_us;
            portENTER_CRITICAL(&s_telemetry_lock);
            s_telemetry = (esp32_wifi_drone_remote_telemetry_t) {
                .acceleration_x = sample.acceleration_g.x,
                .acceleration_y = sample.acceleration_g.y,
                .acceleration_z = sample.acceleration_g.z,
                .gyroscope_x = sample.angular_rate_dps.x,
                .gyroscope_y = sample.angular_rate_dps.y,
                .gyroscope_z = sample.angular_rate_dps.z,
            };
            portEXIT_CRITICAL(&s_telemetry_lock);

            const flight_imu_sample_t flight_sample = {
                .acceleration_g = {
                    sample.acceleration_g.x,
                    sample.acceleration_g.y,
                    sample.acceleration_g.z,
                },
                .angular_rate_dps = {
                    sample.angular_rate_dps.x,
                    sample.angular_rate_dps.y,
                    sample.angular_rate_dps.z,
                },
            };
            flight_controller_output_t output;
            if (dt_seconds > 0.0f && dt_seconds <= 0.1f &&
                xSemaphoreTake(s_flight_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
                err = flight_controller_update(
                    &s_flight_controller, &flight_sample, dt_seconds,
                    (uint64_t)now_us, &output);
                xSemaphoreGive(s_flight_mutex);
                if (err == ESP_OK &&
                    (output.armed || flight_was_armed) &&
                    xSemaphoreTake(s_esc_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
                    for (size_t index = 0; index < ESC_COUNT; ++index) {
                        esp_err_t motor_err = xw30a_control_set_throttle(
                            s_esc_handles[index], output.motor[index]);
                        if (motor_err != ESP_OK) {
                            ESP_LOGE(APP_TAG, "ESC %u control failed: %s",
                                     (unsigned)(index + 1U),
                                     esp_err_to_name(motor_err));
                        }
                    }
                    xSemaphoreGive(s_esc_mutex);
                }
                if (err == ESP_OK) {
                    flight_was_armed = output.armed;
                }
            }
            ++sample_count;
        } else {
            ESP_LOGE(APP_TAG, "Failed to read ISM330DLC: %s",
                     esp_err_to_name(err));
            if (flight_was_armed &&
                xSemaphoreTake(s_flight_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
                flight_controller_set_armed(
                    &s_flight_controller, false,
                    (uint64_t)esp_timer_get_time());
                xSemaphoreGive(s_flight_mutex);
                if (xSemaphoreTake(s_esc_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
                    for (size_t index = 0; index < ESC_COUNT; ++index) {
                        (void)xw30a_control_stop(s_esc_handles[index]);
                    }
                    xSemaphoreGive(s_esc_mutex);
                }
                flight_was_armed = false;
            }
            vTaskDelay(1);
        }

        /* Give the idle task occasional CPU time without pacing every read. */
        if ((sample_count % IMU_YIELD_INTERVAL) == 0U) {
            vTaskDelay(1);
        }
    }
}
